blog/confusion-points.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-22 Wed 14:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>混淆点</title>
<meta name="author" content="Siqing Mu" />
<meta name="generator" content="Org Mode" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">混淆点</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgaf795d5">1. 地址和指针（Addresses and Pointers）</a></li>
<li><a href="#orgbbec455">2. 帧和栈 (Frames and Stack)</a></li>
<li><a href="#org575e641">3. 栈和堆 (Stack and Heap)</a></li>
<li><a href="#orgef216a1">4. 局部变量/全局变量/静态变量 （Local Variables / Global Variables / Static Variables）</a></li>
<li><a href="#org61669d2">5. 值传递和引用传递</a></li>
</ul>
</div>
</div>
<p>
各类语言经常有一些容易让人产生的混淆点，今天我们列举一下：
</p>

<div id="outline-container-orgaf795d5" class="outline-2">
<h2 id="orgaf795d5"><span class="section-number-2">1.</span> 地址和指针（Addresses and Pointers）</h2>
<div class="outline-text-2" id="text-1">
<p>
关于地址和指针，在理解变量状态及操作可以说很重要也很基础的概念。之前有写过可以在下面找到。作为补充，下面有个容易混淆的概念。
</p>
<pre class="example" id="org208235c">
ini i = 17;
int *addressOfI = &amp;i;
*addressOfI = 89;
</pre>

<p>
星号有两种不同用法
</p>
<ul class="org-ul">
<li>第一种，声明指针：将变量addressOfI声明为 int *, 即指向保存int值的内存地址。</li>
<li>第二种，去引用： 访问保存在addressOfI地址中的int值，指针也称为引用，所以通过指针访问某个地址中的数据这一过程，有时也称去引用。</li>
</ul>

<p>
&amp; 运算符，可以得到变量的地址。
</p>

<pre class="example" id="orgff2502a">
int x = 1;
int *y = &amp;x; // &amp;x 变量x地址赋给y指针
printf("x value is %d\n", x);  // x的值
printf("x self address is %p\n", &amp;x); // x自身的地址
printf("y stored address is %p\n", y); // y存储的指针地址
printf("y self address is %p\n", &amp;y); //y自身的地址
printf("y stored address is %p\n", *&amp;y);//y存储的地址
</pre>
<p>
简单来讲：
</p>
<ol class="org-ol">
<li>int *指向的是存储的变量地址，而非自身地址。</li>
<li>* 指向的是值。</li>
<li>&amp; 变量的地址。</li>
</ol>
</div>
</div>
<div id="outline-container-orgbbec455" class="outline-2">
<h2 id="orgbbec455"><span class="section-number-2">2.</span> 帧和栈 (Frames and Stack)</h2>
<div class="outline-text-2" id="text-2">
<p>
为了理解这两个概念，我们先看一个函数执行过程。
</p>
<pre class="example" id="orgac5cbd5">
#include &lt;stdio.h&gt;

void singSongFor(int numberOfBottles)
{
    if (numberOfBottles == 0) {
        printf("There are simple no more bottles of beer on the wall.\n");
    } else {
        printf("%d bottles of beer on the wall. %d bottles of beer.\n", numberOfBottles, numberOfBottles);
        
        int oneFewer = numberOfBottles - 1;
        printf("Take one down, pass it around, %d bottles of beer on the wall.\n", oneFewer);
        singSongFor(oneFewer);
        
        printf("Put a bottle in the recycling, %d empty bottles in the bin.\n", numberOfBottles);
    }
    
}

int main(int argc, const char * argv[]) {
    singSongFor(4);
    return 0;
}
</pre>

<p>
再来看一下它的输出。
</p>
<pre class="example" id="orgd4d4c70">
4 bottles of beer on the wall. 4 bottles of beer.
Take one down, pass it around, 3 bottles of beer on the wall.
3 bottles of beer on the wall. 3 bottles of beer.
Take one down, pass it around, 2 bottles of beer on the wall.
2 bottles of beer on the wall. 2 bottles of beer.
Take one down, pass it around, 1 bottles of beer on the wall.
1 bottles of beer on the wall. 1 bottles of beer.
Take one down, pass it around, 0 bottles of beer on the wall.
There are simple no more bottles of beer on the wall.
Put a bottle in the recycling, 1 empty bottles in the bin.
Put a bottle in the recycling, 2 empty bottles in the bin.
Put a bottle in the recycling, 3 empty bottles in the bin.
Put a bottle in the recycling, 4 empty bottles in the bin.
Program ended with exit code: 0
</pre>

<p>
有没有疑问，比如说为什么后面变成了1234，而不是4321。
</p>
</div>
</div>



<div id="outline-container-org575e641" class="outline-2">
<h2 id="org575e641"><span class="section-number-2">3.</span> 栈和堆 (Stack and Heap)</h2>
</div>

<div id="outline-container-orgef216a1" class="outline-2">
<h2 id="orgef216a1"><span class="section-number-2">4.</span> 局部变量/全局变量/静态变量 （Local Variables / Global Variables / Static Variables）</h2>
</div>

<div id="outline-container-org61669d2" class="outline-2">
<h2 id="org61669d2"><span class="section-number-2">5.</span> 值传递和引用传递</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="https://www.khow.me/blog/pointer-and-address.html">https://www.khow.me/blog/pointer-and-address.html</a></li>
<li><a href="https://www.cs.rutgers.edu/~pxk/419/notes/frames.html">https://www.cs.rutgers.edu/~pxk/419/notes/frames.html</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>
